const supers = [{
    "name": "Бетмен",
    "universe": "DC Comics",
    "alterego": "Брюс Уэйн",
    "occupation": "борец с преступностью, филантроп, миллиардер",
    "friends": "Робин, Бэтгерл",
    "superpowers": "интеллект, обширные познания, знания боевых искусств, ловкость",
    "url": "https://n1s1.hsmedia.ru/13/a5/b2/13a5b2373d5e23489d9a4949ada5b927/547x397_0xac120002_8752067681540468870.jpg",
    "info": "По популярности человек-летучая мышь может сравниться только с Суперменом. Его образ кажется очень мистическим и мрачным: черный костюм с развевающимся плащом, устрашающий Бэтмобиль, штаб-квартира в сырой пещере. Его биография настолько же темна, как и образ. В детстве у него на глазах убили родителей, и юный Брюс поклялся всеми силами защищать родной Готэм от преступности. Брюс знаменит, несмотря на пожилой возраст: первый выпуск с его участием вышел аж в 1939 году. С каждым годом популярность только крепнет. Большую роль в этом сыграли экранизации: «Темный рыцарь», сериал «Готэм» и несколько одноименных картин. Главная причина такой любви среди фанатов — мысль, что каждый может стать Бэтменом. Если подумать, это один из немногих героев, кто добился своего положения за счет ума и упорства, а не за счет мутаций."
},{
    "name": "Супермен",
    "universe": "DC Comics",
    "alterego": "Кларк Кент",
    "occupation": "борец за справедливость",
    "friends": "собака Крипто",
    "superpowers": "непробиваемость, суперсила, полёт, самоисцеление, суперзрение и суперслух, классный костюм",
    "url" : "https://n1s1.hsmedia.ru/06/d3/73/06d37321618034ec5f2a65b09c8576e3/547x397_0xac120002_45567661540468871.jpg",
    "info": "Полная противоположность своему противнику Бэтмену. Если Брюс Уэйн был простым человеком и стал героем, то Супермен героем родился, но вынужден был изображать выходца из бедной канзасской семьи. Последний представитель планеты Криптон был отправлен на Землю прямо перед тем, как его родина была уничтожена. Супермен — некий хамелеон от мира комиксов. В своем первом выпуске в 1938 году он был просто человек-огромный мускул, который умел только разбивать стены и выбивать двери. Позднее к его умениям добавилась способность летать. Дальше у многочисленных воплощений Кларка, от подростка в «Тайнах Смоллвиля» до величественного «Человека из стали», разный уровень и количество суперспособностей. Неизменным остается его слабое место — уязвимость к Криптониту, радиоактивному веществу с родной планеты." 
    }
    ,{
        "name": "Железный человек",
        "universe": "Marvel Comics",
        "alterego": "Тони Старк",
        "occupation": "гений, миллиардер, плейбой, филантроп",
        "friends": "Мстители",
        "superpowers": "высокий уровень интеллекта, широкие познания науки и техники, связь со всемирной паутиной, бронекостюмы",
        "url" : "https://n1s1.hsmedia.ru/7b/56/08/7b5608ec3df83d872fa1162fb9e32f28/547x397_0xac120002_1773711401540468871.jpg",
        "info": "Пожалуй, самый популярный современный супергерой. У него много общего с мрачной птицей ночи Бэтменом: оба потеряли родителей в детстве, стали борцами с преступностью без особых сверхсил, невероятно богатые. Только если Бэтменом восхищаются, то Тони Старка — обожают :) То ли дело в шикарной актерской игре Роберта Дауни мл., который выбил роль у Николаса Кейджа и Тома Круза, то ли в хорошо прописанном персонаже. Прототипом для героя послужили Илон Маск и изобретатель Говард Хьюз. Железный Человек не всегда ходил в красном модном костюме: в своих первых версиях 1963 года он был скромного серого цвета. Увы, в киновоплощении бронекостюм даже не из металла — его делали из пластика и стекловолокна."
    },{
        "name": "Спайдер-мен/Человек-паук",
        "universe": "Marvel Comics",
        "alterego": "Питер Паркер",
        "occupation": "борец за справедливость, студент, фотограф",
        "friends": "Мстители, Фантастическая четверка, Люди Икс",
        "superpowers": "сверхчеловеческие рефлексы, «паучье чутьё», способность прилепляться к твердым поверхностям, производство паутины",
        "url" : "https://n1s1.hsmedia.ru/37/39/74/373974effcc7ccd093d849e8fa062091/547x397_0xac120002_9548247751540468871.jpg",
        "info": "Человек-паук родился от потребности Marvel Comics создать героя-подростка. Другие супергерои вроде Бэтмена и Супермена — взрослые мужчины, и целевая аудитория не видела в них примеры для подражания. Пятнадцатилетний Питер Паркер дал понять всем тинейджерам Земли, что можно и злодеев уничтожить, и на красавице жениться. Для этого даже не обязательно быть суперкрасавчиком! Всего лишь нужен укус паучка:) Питер не сразу использовал свои силы во благо людей: изначально он хотел делать на них деньги, участвуя в нелегальных боях без правил. Затем его любимый дядя Бен умер от рук грабителя, и подросток поклялся, что очистит свой родной Нью-Йорк ото зла. Однако спустя время подросток понял, что одной клятвы недостаточно и что «с великой силой приходит великая ответственность». Кстати, не все суперсилы у Питера появились за счет мутации: парень самостоятельно взломал технологию Тони Старка, после чего заслужил его признание. "
    }
    ,{
        "name": "Капитан Америка",
        "universe": "Marvel Comics",
        "alterego": "Стивен Роджерс",
        "occupation": "супер-солдат",
        "friends": "Мстители",
        "superpowers": "сила, выносливость, бессмертие, быстрая регенерация, мастерство скрытности и боя",
        "url" : "https://n1s1.hsmedia.ru/41/8f/05/418f050c767eeca8854b328914c7bccc/547x397_0xac120002_20106541761540468871.jpg",
        "info": "Капитан Америка — персонаж, целеноправленно созданный, чтобы воплощать идеалы патриотизма. Потому он был особенно популярный во время Второй мировой войны. В комиксах обращение «Капитан Америка» применяется к любому, кто выбран правительством США. Больше всего оно закрепилось именно за Стивом Роджерсом. Стив родился в 1917 году в семье ирландских эмигрантов Сары и Джозефа Роджерсов. В детстве он был очень слабым юношей и постоянно подвергался насмешкам со стороны других ребят. Ирландские корни давали о себе знать, потому парень от драки не лез. В начале Второй мировой войны Стивен стремился попасть на фронт. Естественно, из-за здоровья ему отказывали. По воле судьбы ему предложили принять участие в секретном оборонном проекте, целью которого было создание суперсолдат. Несмотря на сложности во время эксперимента, результат был успешным. Роджерс превратился из хилого юноши в настоящего Аполлона. Актер Крис Эванс с этой ролью вполне справился:)"
    },{
        "name": "Тор",
        "universe": "Marvel Comics",
        "alterego": "нет; полное имя — Тор Одинсон",
        "occupation": "борец за справедливость, скандинавский бог",
        "friends": "Мстители",
        "superpowers": "всё, что может бог, плюс молот Мьелнир",
        "url" : "https://n1s1.hsmedia.ru/52/a3/e1/52a3e14a0c8f02715b763e7a20fe1c00/547x397_0xac120002_19311926741540468872.jpg",
        "info": "Персонаж Тора основан на образе одноименного скандинавского бога. Тор во вселенной Marvel — родной сын Одина и древнейшей богини Геи. После рождения сына Один забрал его в Асгард, где растил вместе со своей женой, богиней Фригг. Последнюю Тор всегда считал своей настоящей матерью и лишь много позже узнал правду о своем рождении. Стоит сказать, что до нынешнего Тора в исполнении Криса Хемсворта у супергероя было несколько воплощений. В одном из них он погиб в схватке с мифическим змеем Мидгардом. Это привело к Рагнареку — некоему апокалипсису в скандинавской мифологии. "
    },{
        "name": "Халк",
        "universe": "Marvel Comics",
        "alterego": "Брюс Беннер",
        "occupation": "супергерой, борец за справедливость, ученый-биохимик",
        "friends": "Мстители",
        "superpowers": "сверхчеловеческая сила и скорость, выносливость, полёт",
        "url" : "https://n1s1.hsmedia.ru/9a/28/e7/9a28e7b059594fc10387669ae4bd2f22/547x397_0xac120002_20162335021540468872.jpg",
        "info": "Идею создания Халка как персонажа можно отнести к фантастической новелле «Странная история доктора Джекила и мистера Хайда», в которой ученый не может примириться со своим демоническим альтер эго. Прошлое у Халка — хуже некуда: отец Брюса страдал от алкоголизма и приступов ярости, а мать пыталась всеми силами уберечь сына от гнева своего мужа. Она погибла, защищая своего единственного ребенка от его побоев. Пронеся через все детство тяжелый психологический груз, Брюс вырос в чрезвычайно одаренного, но замкнутого юношу. Хотя Брюс не мог уважать отца, но пошел в науке по его стопам и выбрал ядерную физику. Во время эксперимента он ввел себе пробную сыворотку и подверг себя воздействию большого количества гамма-радиации. Беннер превратился в мускулистого неуправляемого гиганта, который крушил все вокруг и не понимал, что происходит. Так имя Халка стало нарицательным для людей, который не могут держать себя в руках."
    },{
        "name": "Чудо-женщина",
        "universe": "DC Comics",
        "alterego": "Диана Принс",
        "occupation": "супергероиня, секретарь-референт",
        "friends": "Лига Справедливости, Бэтмен, Супермен",
        "superpowers": "сверхчеловеческая сила искорость, выносливость, полёт",
        "url" : "https://n1s1.hsmedia.ru/87/ed/c5/87edc525d8813c7b2899e04a4e562fe9/547x397_0xac120002_6444132261540468872.jpg",
        "info": "Пора бы разбавить эту мужскую вечеринку по-настоящему крутой девчонкой :) Принцесса-амозонка родилась на мистическом острове Темескира, расположенном в центре Бермудского треугольника, где пропадают самолеты. Своё настоящее имя Диана она получила в честь древнегреческой богини охоты, а суперспособности от богини любви Афродиты. Растили героиню в исключительно женском обществе, поэтому Чудо-женщина часто появляется в культуре как символ феминизма. У Дианы есть супер-снаряжение: лассо истины и тиара. Первое было сковано богом огня Гефестом, и оно никогда не промахивается. Человек, попавший в его петлю, неизбежно расскажет свои секреты, вспомнит забытое и даже подчинится приказам. Тиара же работает как метательное оружие, способное рассечь что угодно. Корона со звездой в центре символизирует патриотизм американской героини и служит стильным аксессуаром :)"
    },{
        "name": "Дэдпул",
        "universe": "Marvel Comics",
        "alterego": "Уэйд Уинстон Уилсон",
        "occupation": "антигерой, наёмник",
        "friends": "частично Мстители, Человек-паук, Росомаха",
        "superpowers": "высокий болевой порог, регенерация и бессмертие, сверхчеловеческая иммунная система",
        "url" : "https://n1s1.hsmedia.ru/34/93/39/3493392c94fc2ae0552ef9c7e87f2617/728x382_1_cc2a743fd686b7b2e256c062966bb465@1034x543_0xac120002_2692921231540468872.jpg",
        "info": "Как и Росомаха из Людей Икс, Дэдпул был подвергнут опытам по программе «Оружие Икс». Ученые попытались исцелить его рак, привив его клеткам способность к регенерации. Как и всегда в комиксах, что-то пошло не так, и Дэдпул остался изуродованным и психически нестабильным. Это единственный супергерой из списка, который однозначно не на стороне добра. Дэдпул наслаждается насилием. Первоначально появившись в основной Вселенной Marvel, он получил альтернативные варианты в других реальностях Мультивселенной. Что оставалось неизменным — его циничное, чёрное чувство юмора: за него Дэдпула прозвали «Болтливым наёмником»."
    }];

const supersJSON = JSON.stringify(supers);
const supersObject = JSON.parse(supersJSON);
const numberSuper = supersObject.length;

let nameSuper = "" ;
let infoSuper ="";
let articles ="";
let alteregoSuper ="";
let friendsSuper ="";
let imgSuper ="";
let raitingStar = "";

for (let i = 0; i < numberSuper; i++) { 
    nameSuper= supersObject[i].name;
    infoSuper= supersObject[i].occupation;
    alteregoSuper = supersObject[i].alterego;
    friendsSuper = supersObject[i].friends;
    textSuper = supersObject[i].info;
    imgSuper = supersObject[i].url;
    articles += aboutSuper(`${nameSuper}`,`${infoSuper}`,`${imgSuper}`, `${alteregoSuper}`, `${friendsSuper}`,`${textSuper}`,`${i}`);
    
    }
    
let rootSuper = document.getElementsByClassName("root")[0];
rootSuper.innerHTML = `${articles}`; 
colorizeStar ();
function colorizeStar (){
  for (let i = 0; i < numberSuper; i++){
    raitingStar = localStorage.getItem(`${i}`);
    if (raitingStar) {
      const form = document.getElementById(`${i}`);
      // const inputs = form.querySelectorAll('.container__input');
      const icons = form.querySelectorAll('.icon');
      console.log(icons);
     icons.forEach((elem) => {
     elem.style = 'fill: black';
     })

    for (let i = 0; i < raitingStar; i++) {
      icons[i].style = 'fill: gold';
      
      }
    // }
      console.log(raitingStar);}
    }}





function aboutSuper(nameSuper,infoSuper, img, alterego, friends,text, i){
  let stars = createStars(`${i}`);
  let article = "";
  if ( i % 2 === 0) { article = `<div class="card">
                   ${stars}
              <div class="card__img">
            <img src="${img}" alt="" class="">
            </div>
                 <div class="card__name">${nameSuper}</div>
                 <div class="card__info">${infoSuper}</div>
                 <div class="card__link" >
                 <a href="#" onclick="seeMore(${i})" >больше информации</a> </div>
                 <div class="card__more">
                    <p class="card__alterego">${alterego}</p> 
                    <p class="card__friends">друзья: ${friends}</p>
                    <p class="card__text">${text}</p>
                    <div class="card__link" >
                         <a href="#" onclick="hideMore(${i})" >свернуть</a>
                    </div>
                   </div>
             </div>`;}
             else {article = `<div class="card card_left">
                  ${stars}
                   <div class="card__img">
                   <img src="${img}" alt="" class="">
                  </div>
                  <div class="card__name">${nameSuper}</div>
                  <div class="card__info">${infoSuper}</div>
                  <div class="card__link" >
                  <a href="#" onclick="seeMore(${i})" >больше информации</a> </div>
                   <div class="card__more">
                   <p class="card__alterego">${alterego}</p> 
                   <p class="card__friends">друзья: ${friends}</p>
                   <p class="card__text">${text}</p>
                   <div class="card__link" >
                        <a href="#" onclick="hideMore(${i})" >свернуть</a>
                   </div>
                  </div>
            </div>
             
             `}
  
  return article;
}
function createStars(i){
  
  let stars = `<div class="card__stars">
  <div class="container">
  <form id="${i}" action="#">
    <label class="container__label" for="">
       <input type="radio" value="1" class="container__input" name="raiting">
         <svg class="icon">
             <use xlink:href="icons/sprite.svg#star-full-icon"></use>
           </svg>
     </label>
    <label class="container__label" for=""><input type="radio" value="2" class="container__input" name="raiting">
      <svg class="icon">
         <use xlink:href="icons/sprite.svg#star-full-icon"></use>
      </svg>
      </label>
    <label class="container__label" for=""><input type="radio" value="3" class="container__input" name="raiting">
      <svg class="icon">
         <use xlink:href="icons/sprite.svg#star-full-icon"></use>
        </svg>
     </label>
    <label class="container__label" for=""><input type="radio" value="4" class="container__input" name="raiting">
    <svg class="icon">
    <use xlink:href="icons/sprite.svg#star-full-icon"></use>
    </svg>
    </label>
    <label class="container__label" for=""><input type="radio" value="5" class="container__input" name="raiting">
       <svg class="icon">
         <use xlink:href="icons/sprite.svg#star-full-icon"></use>
      </svg>
     </label>
  </form>
</div>
    </div>`   
  return stars;
      }
function seeMore(n){
     let seeMore=document.getElementsByClassName("card__more")[n];
     seeMore.style = "display:block";
}
function hideMore(n){
    let hideMore=document.getElementsByClassName("card__more")[n];
    hideMore.style = "display: none";
    
}

const root = document.querySelector('.root');

root.addEventListener('click', (event) => {
  if (event.target.classList.contains('container__input')) {
    const form = event.target.parentNode.parentNode;
    const inputs = form.querySelectorAll('.container__input');
    const icons = form.querySelectorAll('.icon');
    const key = form.id;
    const value = event.target.value;

    icons.forEach((elem) => {
      elem.style = 'fill: black';
    })

    for (let i = 0; i < inputs.length; i++) {
      icons[i].style = 'fill: gold';
      if (inputs[i].checked) {
        break
      }
    }

    // console.log(event.target.value);
    localStorage.setItem(key, value);

  }
})
